{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "inputLayer", "trainable": true, "batch_input_shape": [null, 5], "dtype": "float32", "units": 5, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer0", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer1", "trainable": true, "units": 32, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer2", "trainable": true, "units": 21, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer3", "trainable": true, "units": 16, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer4", "trainable": true, "units": 12, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer5", "trainable": true, "units": 10, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer6", "trainable": true, "units": 9, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer7", "trainable": true, "units": 8, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer8", "trainable": true, "units": 7, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer9", "trainable": true, "units": 6, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer10", "trainable": true, "units": 5, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer11", "trainable": true, "units": 5, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer12", "trainable": true, "units": 4, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer13", "trainable": true, "units": 4, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "finalDropout", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["bedffnn.pbf"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [5], "dtype": "float32", "quantization": {"min": 0.8108472228050232, "scale": 6.337680432473966e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/beta", "shape": [5], "dtype": "float32", "quantization": {"min": -0.23245108462793382, "scale": 4.77184908808601e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_mean", "shape": [5], "dtype": "float32", "quantization": {"min": -0.022761275663606962, "scale": 1.217050350957489e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_variance", "shape": [5], "dtype": "float32", "quantization": {"min": 0.0005300328484736383, "scale": 2.2274923221725225e-07, "dtype": "uint16"}}, {"name": "batch_normalization_10/gamma", "shape": [7], "dtype": "float32", "quantization": {"min": 0.8728584051132202, "scale": 2.1855054607814823e-06, "dtype": "uint16"}}, {"name": "batch_normalization_10/beta", "shape": [7], "dtype": "float32", "quantization": {"min": -0.19791736462718884, "scale": 5.52965368314676e-06, "dtype": "uint16"}}, {"name": "batch_normalization_10/moving_mean", "shape": [7], "dtype": "float32", "quantization": {"min": -0.05206773447747806, "scale": 1.27314312730709e-06, "dtype": "uint16"}}, {"name": "batch_normalization_10/moving_variance", "shape": [7], "dtype": "float32", "quantization": {"min": 0.001010709092952311, "scale": 3.6388101547779114e-07, "dtype": "uint16"}}, {"name": "batch_normalization_11/gamma", "shape": [6], "dtype": "float32", "quantization": {"min": 0.9095098972320557, "scale": 1.375433454035512e-06, "dtype": "uint16"}}, {"name": "batch_normalization_11/beta", "shape": [6], "dtype": "float32", "quantization": {"min": -0.017917155158910153, "scale": 2.4453603328661323e-06, "dtype": "uint16"}}, {"name": "batch_normalization_11/moving_mean", "shape": [6], "dtype": "float32", "quantization": {"min": 0.01700889877974987, "scale": 1.4843836289171751e-06, "dtype": "uint16"}}, {"name": "batch_normalization_11/moving_variance", "shape": [6], "dtype": "float32", "quantization": {"min": 0.001954785780981183, "scale": 5.278499703051397e-07, "dtype": "uint16"}}, {"name": "batch_normalization_12/gamma", "shape": [5], "dtype": "float32", "quantization": {"min": 0.8309152722358704, "scale": 3.1414617342143817e-06, "dtype": "uint16"}}, {"name": "batch_normalization_12/beta", "shape": [5], "dtype": "float32", "quantization": {"min": -0.09821670043952334, "scale": 4.0208253342417545e-06, "dtype": "uint16"}}, {"name": "batch_normalization_12/moving_mean", "shape": [5], "dtype": "float32", "quantization": {"min": -0.07555007263898686, "scale": 2.515317373784354e-06, "dtype": "uint16"}}, {"name": "batch_normalization_12/moving_variance", "shape": [5], "dtype": "float32", "quantization": {"min": 0.0005534939118660986, "scale": 4.6626284818417323e-07, "dtype": "uint16"}}, {"name": "batch_normalization_13/gamma", "shape": [5], "dtype": "float32", "quantization": {"min": 0.8552291393280029, "scale": 2.666346275752766e-06, "dtype": "uint16"}}, {"name": "batch_normalization_13/beta", "shape": [5], "dtype": "float32", "quantization": {"min": -0.12207025368060219, "scale": 3.6902643272348678e-06, "dtype": "uint16"}}, {"name": "batch_normalization_13/moving_mean", "shape": [5], "dtype": "float32", "quantization": {"min": -0.036983454987796684, "scale": 1.91743337763359e-06, "dtype": "uint16"}}, {"name": "batch_normalization_13/moving_variance", "shape": [5], "dtype": "float32", "quantization": {"min": 0.0014860490337014198, "scale": 8.671168254125197e-07, "dtype": "uint16"}}, {"name": "batch_normalization_14/gamma", "shape": [4], "dtype": "float32", "quantization": {"min": 0.7249889373779297, "scale": 5.508233164453103e-06, "dtype": "uint16"}}, {"name": "batch_normalization_14/beta", "shape": [4], "dtype": "float32", "quantization": {"min": -0.10513538454375133, "scale": 2.181775225030118e-06, "dtype": "uint16"}}, {"name": "batch_normalization_14/moving_mean", "shape": [4], "dtype": "float32", "quantization": {"min": -0.08745201562736003, "scale": 2.5064347719285784e-06, "dtype": "uint16"}}, {"name": "batch_normalization_14/moving_variance", "shape": [4], "dtype": "float32", "quantization": {"min": 0.0016179302474483848, "scale": 7.90645026052522e-07, "dtype": "uint16"}}, {"name": "batch_normalization_15/gamma", "shape": [4], "dtype": "float32", "quantization": {"min": 0.9506064057350159, "scale": 5.1034882038256445e-06, "dtype": "uint16"}}, {"name": "batch_normalization_15/beta", "shape": [4], "dtype": "float32", "quantization": {"min": 0.02792554721236229, "scale": 2.6643103976412314e-06, "dtype": "uint16"}}, {"name": "batch_normalization_15/moving_mean", "shape": [4], "dtype": "float32", "quantization": {"min": -0.018237270414829254, "scale": 1.5018904185034986e-07, "dtype": "uint16"}}, {"name": "batch_normalization_15/moving_variance", "shape": [4], "dtype": "float32", "quantization": {"min": 0.008397502824664116, "scale": 2.879953517642421e-07, "dtype": "uint16"}}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.7786543369293213, "scale": 6.116799907316157e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.1510825082403922, "scale": 4.572715140447706e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.041395777551907924, "scale": 2.8735094788218743e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 4.241851274855435e-05, "scale": 2.3332108860588018e-07, "dtype": "uint16"}}, {"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.8216378092765808, "scale": 4.626483696043841e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.09887272205629818, "scale": 5.057686943388316e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -0.2216112821580271, "scale": 9.891152963982464e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.12524060904979706, "scale": 1.2311307545556641e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/gamma", "shape": [21], "dtype": "float32", "quantization": {"min": 0.855490505695343, "scale": 3.3548451801491265e-06, "dtype": "uint16"}}, {"name": "batch_normalization_4/beta", "shape": [21], "dtype": "float32", "quantization": {"min": -0.13818838662510743, "scale": 5.133679568508338e-06, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_mean", "shape": [21], "dtype": "float32", "quantization": {"min": -0.19514149034006006, "scale": 5.085252784178351e-06, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_variance", "shape": [21], "dtype": "float32", "quantization": {"min": 0.08893558382987976, "scale": 1.0585807195069579e-05, "dtype": "uint16"}}, {"name": "batch_normalization_5/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.9166246652603149, "scale": 1.8091871908148138e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.12383272392479026, "scale": 4.563242949655093e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -0.15550542356057145, "scale": 4.09634433276886e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 0.021628908812999725, "scale": 3.951382876224682e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/gamma", "shape": [12], "dtype": "float32", "quantization": {"min": 0.9027432203292847, "scale": 1.9990161835506106e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/beta", "shape": [12], "dtype": "float32", "quantization": {"min": -0.14848936061453216, "scale": 4.034050384811654e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/moving_mean", "shape": [12], "dtype": "float32", "quantization": {"min": -0.11579956861839985, "scale": 3.145701635836136e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/moving_variance", "shape": [12], "dtype": "float32", "quantization": {"min": 0.014967208728194237, "scale": 1.7024021579515855e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/gamma", "shape": [10], "dtype": "float32", "quantization": {"min": 0.8900433778762817, "scale": 3.4917453210850624e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/beta", "shape": [10], "dtype": "float32", "quantization": {"min": -0.14471431645446994, "scale": 3.7543277241340205e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/moving_mean", "shape": [10], "dtype": "float32", "quantization": {"min": -0.032632628533776874, "scale": 1.904998746863799e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/moving_variance", "shape": [10], "dtype": "float32", "quantization": {"min": 0.009135251864790916, "scale": 1.0100312481539886e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/gamma", "shape": [9], "dtype": "float32", "quantization": {"min": 0.8191483020782471, "scale": 4.841485157742001e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/beta", "shape": [9], "dtype": "float32", "quantization": {"min": -0.2633336235140466, "scale": 7.576637803948861e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/moving_mean", "shape": [9], "dtype": "float32", "quantization": {"min": -0.08427625364393958, "scale": 2.928597617678687e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/moving_variance", "shape": [9], "dtype": "float32", "quantization": {"min": 0.006584468763321638, "scale": 1.1477279267563393e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/gamma", "shape": [8], "dtype": "float32", "quantization": {"min": 0.9226914048194885, "scale": 1.7924058480094315e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/beta", "shape": [8], "dtype": "float32", "quantization": {"min": -0.062313063706578235, "scale": 3.285860773390542e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/moving_mean", "shape": [8], "dtype": "float32", "quantization": {"min": -0.18152362898138794, "scale": 4.549008344561646e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/moving_variance", "shape": [8], "dtype": "float32", "quantization": {"min": 0.0103415846824646, "scale": 8.781104108930189e-07, "dtype": "uint16"}}, {"name": "inputLayer/kernel", "shape": [5, 5], "dtype": "float32", "quantization": {"min": -0.5145149523013879, "scale": 1.1537761858128625e-05, "dtype": "uint16"}}, {"name": "middleLayer0/kernel", "shape": [5, 64], "dtype": "float32", "quantization": {"min": -0.15959237275338603, "scale": 9.537012833356402e-06, "dtype": "uint16"}}, {"name": "middleLayer1/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"min": -0.18595294244794902, "scale": 6.011668901071674e-06, "dtype": "uint16"}}, {"name": "middleLayer10/kernel", "shape": [6, 5], "dtype": "float32", "quantization": {"min": -0.05301801761343849, "scale": 2.0607928485030704e-06, "dtype": "uint16"}}, {"name": "middleLayer11/kernel", "shape": [5, 5], "dtype": "float32", "quantization": {"min": -0.09820545262013272, "scale": 3.734189612537843e-06, "dtype": "uint16"}}, {"name": "middleLayer12/kernel", "shape": [5, 4], "dtype": "float32", "quantization": {"min": -0.127710457681982, "scale": 3.3313454111535373e-06, "dtype": "uint16"}}, {"name": "middleLayer13/kernel", "shape": [4, 4], "dtype": "float32", "quantization": {"min": -0.12636601191695898, "scale": 4.222616183818719e-06, "dtype": "uint16"}}, {"name": "middleLayer2/kernel", "shape": [32, 21], "dtype": "float32", "quantization": {"min": -0.16966277701413413, "scale": 4.665551409710824e-06, "dtype": "uint16"}}, {"name": "middleLayer3/kernel", "shape": [21, 16], "dtype": "float32", "quantization": {"min": -0.12359109624937215, "scale": 3.60271378077167e-06, "dtype": "uint16"}}, {"name": "middleLayer4/kernel", "shape": [16, 12], "dtype": "float32", "quantization": {"min": -0.12537983768617678, "scale": 3.59821603346755e-06, "dtype": "uint16"}}, {"name": "middleLayer5/kernel", "shape": [12, 10], "dtype": "float32", "quantization": {"min": -0.084557570038889, "scale": 2.6990191209067956e-06, "dtype": "uint16"}}, {"name": "middleLayer6/kernel", "shape": [10, 9], "dtype": "float32", "quantization": {"min": -0.07738507056255367, "scale": 3.0985013238259726e-06, "dtype": "uint16"}}, {"name": "middleLayer7/kernel", "shape": [9, 8], "dtype": "float32", "quantization": {"min": -0.14580799239973477, "scale": 4.98557041645814e-06, "dtype": "uint16"}}, {"name": "middleLayer8/kernel", "shape": [8, 7], "dtype": "float32", "quantization": {"min": -0.11493543252215883, "scale": 3.284808017209455e-06, "dtype": "uint16"}}, {"name": "middleLayer9/kernel", "shape": [7, 6], "dtype": "float32", "quantization": {"min": -0.07715208026058043, "scale": 2.4882149276157135e-06, "dtype": "uint16"}}, {"name": "output/kernel", "shape": [4, 2], "dtype": "float32", "quantization": {"min": -1.0532892554959743, "scale": 3.1643611593341775e-05, "dtype": "uint16"}}, {"name": "output/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -2.181577830548562, "scale": 6.657647187953375e-05, "dtype": "uint16"}}]}]}