{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"name": "inputLayer", "trainable": true, "batch_input_shape": [null, 112], "dtype": "float32", "target_shape": [7, 16]}}, {"class_name": "Conv1D", "config": {"name": "smallConv1D", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "mediumConv1D", "trainable": true, "filters": 48, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "largeConv1D", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "hugeConv1D", "trainable": true, "filters": 80, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "massiveConv1D", "trainable": true, "filters": 96, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "globalAveragePool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "globalAverageDropout", "trainable": true, "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["ecnn.pbf"], "weights": [{"name": "hugeConv1D/kernel", "shape": [4, 64, 80], "dtype": "float32", "quantization": {"min": -0.9303426819952891, "scale": 2.4747105442232513e-05, "dtype": "uint16"}}, {"name": "hugeConv1D/bias", "shape": [80], "dtype": "float32", "quantization": {"min": -0.18430984903456935, "scale": 5.230428771058782e-06, "dtype": "uint16"}}, {"name": "largeConv1D/kernel", "shape": [4, 48, 64], "dtype": "float32", "quantization": {"min": -0.966494745464031, "scale": 2.3436425361042484e-05, "dtype": "uint16"}}, {"name": "largeConv1D/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.1907567201666986, "scale": 4.760349375291939e-06, "dtype": "uint16"}}, {"name": "massiveConv1D/kernel", "shape": [4, 80, 96], "dtype": "float32", "quantization": {"min": -0.642656005482984, "scale": 2.0279457415051562e-05, "dtype": "uint16"}}, {"name": "massiveConv1D/bias", "shape": [96], "dtype": "float32", "quantization": {"min": -0.11451313604958918, "scale": 3.7432379723322822e-06, "dtype": "uint16"}}, {"name": "mediumConv1D/kernel", "shape": [4, 32, 48], "dtype": "float32", "quantization": {"min": -0.48958909672640133, "scale": 1.3965516066018237e-05, "dtype": "uint16"}}, {"name": "mediumConv1D/bias", "shape": [48], "dtype": "float32", "quantization": {"min": -0.13003985702632231, "scale": 3.911208404304689e-06, "dtype": "uint16"}}, {"name": "output/kernel", "shape": [96, 2], "dtype": "float32", "quantization": {"min": -0.4678861555449612, "scale": 1.6746104350213358e-05, "dtype": "uint16"}}, {"name": "output/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.01967980950713235, "scale": 6.005984529292383e-07, "dtype": "uint16"}}, {"name": "smallConv1D/kernel", "shape": [4, 16, 32], "dtype": "float32", "quantization": {"min": -0.5497482652548495, "scale": 1.7081415152089533e-05, "dtype": "uint16"}}, {"name": "smallConv1D/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.11728181664500037, "scale": 4.3695025015834125e-06, "dtype": "uint16"}}]}]}