{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_1d", "trainable": true, "batch_input_shape": [null, 464], "dtype": "float32", "target_shape": [8, 58]}}, {"class_name": "Conv1D", "config": {"name": "small_conv", "trainable": true, "filters": 64, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pool_small", "trainable": true, "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "big_conv_1", "trainable": true, "filters": 128, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "average_pool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_big_conv", "trainable": true, "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "final_dense", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["acc"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["ecnn.pbf"], "weights": [{"name": "big_conv_1/kernel", "shape": [1, 64, 128], "dtype": "float32", "quantization": {"min": -1.1647833546157322, "scale": 3.353535123990822e-05, "dtype": "uint16"}}, {"name": "big_conv_1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.10515738963964849, "scale": 3.7421226874363363e-06, "dtype": "uint16"}}, {"name": "final_dense/kernel", "shape": [128, 2], "dtype": "float32", "quantization": {"min": -1.963421486778664, "scale": 6.050232610559176e-05, "dtype": "uint16"}}, {"name": "final_dense/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.06336849344793533, "scale": 1.9339119677704804e-06, "dtype": "uint16"}}, {"name": "small_conv/kernel", "shape": [2, 58, 64], "dtype": "float32", "quantization": {"min": -1.0597663379455855, "scale": 2.685400207646426e-05, "dtype": "uint16"}}, {"name": "small_conv/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.33646298255747237, "scale": 1.0629398577035205e-05, "dtype": "uint16"}}]}]}