{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 3], "dtype": "float32", "units": 3, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 14, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 14, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 14, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 14, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["edffnn.pbf"], "weights": [{"name": "batch_normalization_v1/gamma", "shape": [3], "dtype": "float32", "quantization": {"min": 0.9163987636566162, "scale": 1.0946235895393332e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1/beta", "shape": [3], "dtype": "float32", "quantization": {"min": -0.08467791882092977, "scale": 3.877016566133866e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1/moving_mean", "shape": [3], "dtype": "float32", "quantization": {"min": -0.006284504599299103, "scale": 2.651242237301343e-07, "dtype": "uint16"}}, {"name": "batch_normalization_v1/moving_variance", "shape": [3], "dtype": "float32", "quantization": {"min": 1.5909918147372082e-05, "scale": 5.316047172683194e-09, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/gamma", "shape": [14], "dtype": "float32", "quantization": {"min": 0.966252326965332, "scale": 2.3276070812851377e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/beta", "shape": [14], "dtype": "float32", "quantization": {"min": -0.09515191822086744, "scale": 4.213617846996167e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/moving_mean", "shape": [14], "dtype": "float32", "quantization": {"min": -0.033868766566899786, "scale": 7.267351851107155e-07, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/moving_variance", "shape": [14], "dtype": "float32", "quantization": {"min": 3.576448364128737e-07, "scale": 8.158248180241223e-09, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/gamma", "shape": [14], "dtype": "float32", "quantization": {"min": 0.9360132813453674, "scale": 2.3639574106929047e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/beta", "shape": [14], "dtype": "float32", "quantization": {"min": -0.06770055501677674, "scale": 2.503903950616789e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/moving_mean", "shape": [14], "dtype": "float32", "quantization": {"min": -0.077654534128344, "scale": 1.848169410675298e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/moving_variance", "shape": [14], "dtype": "float32", "quantization": {"min": 0.0003124736249446869, "scale": 2.213216652411422e-07, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/gamma", "shape": [14], "dtype": "float32", "quantization": {"min": 0.9594956636428833, "scale": 1.9764367235491786e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/beta", "shape": [14], "dtype": "float32", "quantization": {"min": -0.06511991873441503, "scale": 3.881036935122178e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/moving_mean", "shape": [14], "dtype": "float32", "quantization": {"min": -0.11578670278461008, "scale": 3.551739349221168e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/moving_variance", "shape": [14], "dtype": "float32", "quantization": {"min": 0.00741984648630023, "scale": 7.048200429659137e-07, "dtype": "uint16"}}, {"name": "batch_normalization_v1_4/gamma", "shape": [14], "dtype": "float32", "quantization": {"min": 0.8176467418670654, "scale": 1.1451615251846878e-05, "dtype": "uint16"}}, {"name": "batch_normalization_v1_4/beta", "shape": [14], "dtype": "float32", "quantization": {"min": -0.16662351207142156, "scale": 9.430274043320027e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_4/moving_mean", "shape": [14], "dtype": "float32", "quantization": {"min": -0.20062900438928638, "scale": 5.375047001802668e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_4/moving_variance", "shape": [14], "dtype": "float32", "quantization": {"min": 7.125918637029827e-05, "scale": 1.7127031957258985e-06, "dtype": "uint16"}}, {"name": "dense/kernel", "shape": [3, 3], "dtype": "float32", "quantization": {"min": -0.11091931255943142, "scale": 4.0001194619146535e-06, "dtype": "uint16"}}, {"name": "dense_1/kernel", "shape": [3, 14], "dtype": "float32", "quantization": {"min": -0.1850165417153984, "scale": 6.02443885628597e-06, "dtype": "uint16"}}, {"name": "dense_2/kernel", "shape": [14, 14], "dtype": "float32", "quantization": {"min": -0.17989094771499936, "scale": 4.820099882505811e-06, "dtype": "uint16"}}, {"name": "dense_3/kernel", "shape": [14, 14], "dtype": "float32", "quantization": {"min": -0.15053596774527855, "scale": 4.230320858375117e-06, "dtype": "uint16"}}, {"name": "dense_4/kernel", "shape": [14, 14], "dtype": "float32", "quantization": {"min": -0.14519186758782232, "scale": 4.576143078284869e-06, "dtype": "uint16"}}, {"name": "dense_5/kernel", "shape": [14, 2], "dtype": "float32", "quantization": {"min": -0.8985714954015472, "scale": 2.4947152763862053e-05, "dtype": "uint16"}}, {"name": "dense_5/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.18434451856392695, "scale": 5.625919936641345e-06, "dtype": "uint16"}}]}]}