{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "inputLayer", "trainable": true, "batch_input_shape": [null, 58], "dtype": "float32", "input_dim": 27, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 58}}, {"class_name": "Dropout", "config": {"name": "embeddingDropout", "trainable": true, "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Conv1D", "config": {"name": "smallConv1D", "trainable": true, "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "smallMaxPool", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "bigConv1D", "trainable": true, "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "bigMaxPool", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "biggerConv1D", "trainable": true, "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "globalAveragePool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "bigConv1DDropout", "trainable": true, "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "bigDense", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "bigDenseDropout", "trainable": true, "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["lcnn.pbf"], "weights": [{"name": "bigConv1D/kernel", "shape": [4, 32, 64], "dtype": "float32", "quantization": {"min": -0.6697528303610867, "scale": 1.8217131248771568e-05, "dtype": "uint16"}}, {"name": "bigConv1D/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.08239638525752466, "scale": 1.7215767588960668e-06, "dtype": "uint16"}}, {"name": "bigDense/kernel", "shape": [128, 32], "dtype": "float32", "quantization": {"min": -0.6661090101349533, "scale": 1.9757052057984673e-05, "dtype": "uint16"}}, {"name": "bigDense/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.053888585068358794, "scale": 2.2660352831402714e-06, "dtype": "uint16"}}, {"name": "biggerConv1D/kernel", "shape": [4, 64, 128], "dtype": "float32", "quantization": {"min": -0.6837339098724373, "scale": 2.4706725080307773e-05, "dtype": "uint16"}}, {"name": "biggerConv1D/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.12553712474614975, "scale": 3.1785574059032725e-06, "dtype": "uint16"}}, {"name": "inputLayer/embeddings", "shape": [27, 64], "dtype": "float32", "quantization": {"min": -0.43874179625334725, "scale": 1.3848298600257158e-05, "dtype": "uint16"}}, {"name": "output/kernel", "shape": [32, 2], "dtype": "float32", "quantization": {"min": -0.5254546250196128, "scale": 1.6157394453418186e-05, "dtype": "uint16"}}, {"name": "output/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.05317248850628851, "scale": 1.6227450943415176e-06, "dtype": "uint16"}}, {"name": "smallConv1D/kernel", "shape": [4, 64, 32], "dtype": "float32", "quantization": {"min": -0.4902450690637275, "scale": 1.5407790215089808e-05, "dtype": "uint16"}}, {"name": "smallConv1D/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.17617523949813577, "scale": 3.784238846485571e-06, "dtype": "uint16"}}]}]}