{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "inputLayer", "trainable": true, "batch_input_shape": [null, 64], "dtype": "float32", "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer0", "trainable": true, "units": 240, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer1", "trainable": true, "units": 120, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "finalDropout", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["pdffnn.pbf"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.8096122741699219, "scale": 7.2410016253782714e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.42553290346773937, "scale": 6.87385557890575e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -210488313.041886, "scale": 5422.161593041886, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 1.1520846044594176e+16, "scale": 1886641276053.2678, "dtype": "uint16"}}, {"name": "batch_normalization_2/gamma", "shape": [240], "dtype": "float32", "quantization": {"min": 0.6866278052330017, "scale": 7.821105297237347e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/beta", "shape": [240], "dtype": "float32", "quantization": {"min": -0.35028037428855896, "scale": 5.0132426129077226e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_mean", "shape": [240], "dtype": "float32", "quantization": {"min": -0.7810700405732695, "scale": 2.303429887561619e-05, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_variance", "shape": [240], "dtype": "float32", "quantization": {"min": 0.04738006740808487, "scale": 2.030598982671783e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/gamma", "shape": [120], "dtype": "float32", "quantization": {"min": 0.7781322598457336, "scale": 4.766860888280248e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/beta", "shape": [120], "dtype": "float32", "quantization": {"min": -0.4070785320424975, "scale": 7.783974836845278e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_mean", "shape": [120], "dtype": "float32", "quantization": {"min": -1.7164113917939767, "scale": 4.867457084745985e-05, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_variance", "shape": [120], "dtype": "float32", "quantization": {"min": 0.6441136598587036, "scale": 6.789188868140724e-05, "dtype": "uint16"}}, {"name": "inputLayer/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"min": -0.9499260056248026, "scale": 2.0041901504837913e-05, "dtype": "uint16"}}, {"name": "middleLayer0/kernel", "shape": [64, 240], "dtype": "float32", "quantization": {"min": -0.4654376414654011, "scale": 1.5278283924153135e-05, "dtype": "uint16"}}, {"name": "middleLayer1/kernel", "shape": [240, 120], "dtype": "float32", "quantization": {"min": -0.4357723155346908, "scale": 1.1161628900535085e-05, "dtype": "uint16"}}, {"name": "output/kernel", "shape": [120, 2], "dtype": "float32", "quantization": {"min": -0.28821583538076523, "scale": 8.714535584336626e-06, "dtype": "uint16"}}, {"name": "output/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.044700752571708344, "scale": 1.3642003409438869e-06, "dtype": "uint16"}}]}]}