{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 64], "dtype": "float32", "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.025, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["pdffnn.pbf"], "weights": [{"name": "batch_normalization_v1/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.7714049220085144, "scale": 1.0081279593400992e-05, "dtype": "uint16"}}, {"name": "batch_normalization_v1/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.49951544404029846, "scale": 7.368404990367798e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -249170771.9954223, "scale": 6668.56073853666, "dtype": "uint16"}}, {"name": "batch_normalization_v1/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 1.3624737922023424e+16, "scale": 764389194021.4733, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/gamma", "shape": [24], "dtype": "float32", "quantization": {"min": 0.8719967603683472, "scale": 3.5160637614910193e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/beta", "shape": [24], "dtype": "float32", "quantization": {"min": -0.50070375185322, "scale": 8.227545752390358e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/moving_mean", "shape": [24], "dtype": "float32", "quantization": {"min": -0.4099599992518586, "scale": 1.4618977971396021e-05, "dtype": "uint16"}}, {"name": "batch_normalization_v1_1/moving_variance", "shape": [24], "dtype": "float32", "quantization": {"min": 0.0629676878452301, "scale": 2.0574832604698505e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/gamma", "shape": [24], "dtype": "float32", "quantization": {"min": 0.835290789604187, "scale": 5.000512732915222e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/beta", "shape": [24], "dtype": "float32", "quantization": {"min": -0.3136058648143106, "scale": 6.3644011124162475e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/moving_mean", "shape": [24], "dtype": "float32", "quantization": {"min": -0.3191544002650613, "scale": 7.2687073031124465e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_2/moving_variance", "shape": [24], "dtype": "float32", "quantization": {"min": 0.05089793726801872, "scale": 1.0245047413603414e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/gamma", "shape": [24], "dtype": "float32", "quantization": {"min": 0.810843825340271, "scale": 7.994540397822743e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/beta", "shape": [24], "dtype": "float32", "quantization": {"min": -0.2125370967469554, "scale": 1.0656159275354996e-05, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/moving_mean", "shape": [24], "dtype": "float32", "quantization": {"min": -0.24048897936841285, "scale": 6.438622242200017e-06, "dtype": "uint16"}}, {"name": "batch_normalization_v1_3/moving_variance", "shape": [24], "dtype": "float32", "quantization": {"min": 0.008124303072690964, "scale": 4.997026870750386e-06, "dtype": "uint16"}}, {"name": "dense/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"min": -0.8051178825450014, "scale": 1.7920180790264454e-05, "dtype": "uint16"}}, {"name": "dense_1/kernel", "shape": [64, 24], "dtype": "float32", "quantization": {"min": -0.3975011261957247, "scale": 1.3605597145253446e-05, "dtype": "uint16"}}, {"name": "dense_2/kernel", "shape": [24, 24], "dtype": "float32", "quantization": {"min": -0.2827393495928298, "scale": 7.320302133202925e-06, "dtype": "uint16"}}, {"name": "dense_3/kernel", "shape": [24, 24], "dtype": "float32", "quantization": {"min": -0.3358056659109852, "scale": 7.72641999703155e-06, "dtype": "uint16"}}, {"name": "dense_4/kernel", "shape": [24, 2], "dtype": "float32", "quantization": {"min": -0.5682579136325883, "scale": 1.7893941922492308e-05, "dtype": "uint16"}}, {"name": "dense_4/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.16956302318223201, "scale": 5.174810729765679e-06, "dtype": "uint16"}}]}]}