{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "inputLayer", "trainable": true, "batch_input_shape": [null, 5], "dtype": "float32", "units": 5, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer0", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer1", "trainable": true, "units": 32, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer2", "trainable": true, "units": 21, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer3", "trainable": true, "units": 16, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer4", "trainable": true, "units": 12, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer5", "trainable": true, "units": 10, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer6", "trainable": true, "units": 9, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "middleLayer7", "trainable": true, "units": 8, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "finalDropout", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["uedffnn.pbf"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [5], "dtype": "float32", "quantization": {"min": 0.8718264102935791, "scale": 3.957873925269946e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/beta", "shape": [5], "dtype": "float32", "quantization": {"min": -0.10151437411555583, "scale": 2.293229134921179e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_mean", "shape": [5], "dtype": "float32", "quantization": {"min": -0.014588608678185603, "scale": 1.0114121379773713e-06, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_variance", "shape": [5], "dtype": "float32", "quantization": {"min": 0.0008837491041049361, "scale": 5.306590515035891e-08, "dtype": "uint16"}}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32", "quantization": {"min": 0.8545262217521667, "scale": 5.777022963559008e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32", "quantization": {"min": -0.14931319737639936, "scale": 3.310200132493834e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0817971780606281, "scale": 2.0890075099762002e-06, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"min": 0.0006659140926785767, "scale": 5.206302263608916e-07, "dtype": "uint16"}}, {"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 0.8487213850021362, "scale": 3.906031936222914e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.2614193104848151, "scale": 5.918481106742474e-06, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -0.863162579517884, "scale": 3.205446299457383e-05, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 0.1360669583082199, "scale": 2.7223260968211877e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/gamma", "shape": [21], "dtype": "float32", "quantization": {"min": 0.8616077303886414, "scale": 3.7220738213695487e-06, "dtype": "uint16"}}, {"name": "batch_normalization_4/beta", "shape": [21], "dtype": "float32", "quantization": {"min": -0.2749777422323874, "scale": 5.8202506557812975e-06, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_mean", "shape": [21], "dtype": "float32", "quantization": {"min": -0.28922751271734704, "scale": 1.3706815445587747e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_variance", "shape": [21], "dtype": "float32", "quantization": {"min": 0.027007022872567177, "scale": 1.5301357105202666e-05, "dtype": "uint16"}}, {"name": "batch_normalization_5/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.9099695086479187, "scale": 1.9528304283611833e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.20243256377100152, "scale": 4.9573298339904865e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -0.1159501756320804, "scale": 6.60158139558645e-06, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 0.006350916810333729, "scale": 2.1831155422441998e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/gamma", "shape": [12], "dtype": "float32", "quantization": {"min": 0.8910359144210815, "scale": 2.92111054305e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/beta", "shape": [12], "dtype": "float32", "quantization": {"min": -0.15319890347709095, "scale": 4.47139406564389e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/moving_mean", "shape": [12], "dtype": "float32", "quantization": {"min": -0.2598685638722852, "scale": 7.1392462602276146e-06, "dtype": "uint16"}}, {"name": "batch_normalization_6/moving_variance", "shape": [12], "dtype": "float32", "quantization": {"min": 0.01505335234105587, "scale": 2.848583287729627e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/gamma", "shape": [10], "dtype": "float32", "quantization": {"min": 0.9354199767112732, "scale": 3.3521257494956068e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/beta", "shape": [10], "dtype": "float32", "quantization": {"min": -0.12474658424856824, "scale": 4.274778433574404e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/moving_mean", "shape": [10], "dtype": "float32", "quantization": {"min": -0.07908255574693121, "scale": 3.4053548528153647e-06, "dtype": "uint16"}}, {"name": "batch_normalization_7/moving_variance", "shape": [10], "dtype": "float32", "quantization": {"min": 0.010145053267478943, "scale": 1.6488838024813168e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/gamma", "shape": [9], "dtype": "float32", "quantization": {"min": 0.8751623630523682, "scale": 3.8098150235687813e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/beta", "shape": [9], "dtype": "float32", "quantization": {"min": -0.1764297826048929, "scale": 4.407879443484058e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/moving_mean", "shape": [9], "dtype": "float32", "quantization": {"min": -0.06834876056761402, "scale": 3.196705512726908e-06, "dtype": "uint16"}}, {"name": "batch_normalization_8/moving_variance", "shape": [9], "dtype": "float32", "quantization": {"min": 0.016757411882281303, "scale": 1.5611680949444609e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/gamma", "shape": [8], "dtype": "float32", "quantization": {"min": 0.7157083749771118, "scale": 1.5571423541710998e-05, "dtype": "uint16"}}, {"name": "batch_normalization_9/beta", "shape": [8], "dtype": "float32", "quantization": {"min": -0.15315444641621878, "scale": 1.9587472364268933e-05, "dtype": "uint16"}}, {"name": "batch_normalization_9/moving_mean", "shape": [8], "dtype": "float32", "quantization": {"min": 0.01045406237244606, "scale": 2.5701506797059718e-06, "dtype": "uint16"}}, {"name": "batch_normalization_9/moving_variance", "shape": [8], "dtype": "float32", "quantization": {"min": 0.008399548009037971, "scale": 1.5767954418949707e-06, "dtype": "uint16"}}, {"name": "inputLayer/kernel", "shape": [5, 5], "dtype": "float32", "quantization": {"min": -0.177902796020713, "scale": 5.908821443493855e-06, "dtype": "uint16"}}, {"name": "middleLayer0/kernel", "shape": [5, 64], "dtype": "float32", "quantization": {"min": -0.17424178754309272, "scale": 4.980328918512911e-06, "dtype": "uint16"}}, {"name": "middleLayer1/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"min": -0.19936901848003505, "scale": 6.399262348901783e-06, "dtype": "uint16"}}, {"name": "middleLayer2/kernel", "shape": [32, 21], "dtype": "float32", "quantization": {"min": -0.1629155564632861, "scale": 5.578153682917418e-06, "dtype": "uint16"}}, {"name": "middleLayer3/kernel", "shape": [21, 16], "dtype": "float32", "quantization": {"min": -0.1766677187224352, "scale": 5.4038393149125255e-06, "dtype": "uint16"}}, {"name": "middleLayer4/kernel", "shape": [16, 12], "dtype": "float32", "quantization": {"min": -0.18139854647742717, "scale": 5.382426754418941e-06, "dtype": "uint16"}}, {"name": "middleLayer5/kernel", "shape": [12, 10], "dtype": "float32", "quantization": {"min": -0.12419052342851201, "scale": 4.1659294699443836e-06, "dtype": "uint16"}}, {"name": "middleLayer6/kernel", "shape": [10, 9], "dtype": "float32", "quantization": {"min": -0.11275258066179988, "scale": 4.417858344244177e-06, "dtype": "uint16"}}, {"name": "middleLayer7/kernel", "shape": [9, 8], "dtype": "float32", "quantization": {"min": -0.21974302145498353, "scale": 6.480756818797993e-06, "dtype": "uint16"}}, {"name": "output/kernel", "shape": [8, 2], "dtype": "float32", "quantization": {"min": -1.064495578977821, "scale": 3.4370720318291984e-05, "dtype": "uint16"}}, {"name": "output/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.04208551202893958, "scale": 1.2843870976573863e-06, "dtype": "uint16"}}]}]}